=begin
= スタイルについて
== 指定方法
起動時に
-styles ファイル名
で指定する。

== 書式
Javaのプロパティファイルである。

以下のように指定する。
 スタイル名.font=フォント名-書体-サイズ
 スタイル名.fg=色指定
 スタイル名.bg=色指定
フォント名はプラットフォーム共通のJava論理フォント名
(Serif/SansSerif/Monospaced/Dialog/DialogInput)、
もしくはプラットフォーム固有の物理フォント名

書体はPLAIN/BOLD/ITALIC/BOLDITALIC(大文字小文字の区別はなし)

サイズは整数で単位はポイント。

色指定の値は(({#}))に続いてRGB値を表す6桁の16進数。
(({fg}))の同義語として(({foreground}))、
(({bg}))の同義語として(({background}))が利用可能。

==エンコーディングについて
Javaのプロパティファイルでは、仕様上、
プラットフォームネイティブな文字エンコーディングを出来ないので、
(({ＭＳゴシック}))のような非ASCII文字列を含む場合は、native2ascii
を使用して(({\u}))((|xxxx|))形式に変換する必要がある。
=end
